La-guajolota/PSOC-5lp/lcd_7seg/7seg_multiplexado_hardware.cydsn/Generated_Source/PSoC5/num_Centenas_MIllar.h
/*******************************************************************************
* File Name: num_Centenas_MIllar.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_num_Centenas_MIllar_H) /* CY_CONTROL_REG_num_Centenas_MIllar_H */
#define CY_CONTROL_REG_num_Centenas_MIllar_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} num_Centenas_MIllar_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    num_Centenas_MIllar_Write(uint8 control) ;
uint8   num_Centenas_MIllar_Read(void) ;

void num_Centenas_MIllar_SaveConfig(void) ;
void num_Centenas_MIllar_RestoreConfig(void) ;
void num_Centenas_MIllar_Sleep(void) ; 
void num_Centenas_MIllar_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define num_Centenas_MIllar_Control        (* (reg8 *) num_Centenas_MIllar_Sync_ctrl_reg__CONTROL_REG )
#define num_Centenas_MIllar_Control_PTR    (  (reg8 *) num_Centenas_MIllar_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_num_Centenas_MIllar_H */


/* [] END OF FILE */
